Revit 2027 API
Document.SaveAsCloudModel Method
 Saves current non-workshared or workshared model as a cloud model or workshared cloud model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SaveAsCloudModel(
	Guid accountId,
	Guid projectId,
	string folderId,
	string modelName
)
Public Sub SaveAsCloudModel (
	accountId As Guid,
	projectId As Guid,
	folderId As String,
	modelName As String
)
public:
void SaveAsCloudModel(
	Guid accountId,
	Guid projectId,
	String^ folderId,
	String^ modelName
)
member SaveAsCloudModel :
        accountId : Guid *
        projectId : Guid *
        folderId : string *
        modelName : string -> unit
Parameters
accountId Guid
 Cloud Model account Id. You can use one of the following methods to get this Id:
 If you get the hub Id with Forge Data Management API, remove the prefix "b." of the Id string and convert the rest to a Guid.
projectId Guid
 Cloud Model project Id in Autodesk Project. You can use one of the following methods to get this Id:
 If you get the project Id with Forge Data Management API, remove the prefix "b." of the Id string and convert the rest to a Guid.
folderId String
 Folder identity to save the model in Autodesk Project. You can use one of the following methods to get this Id:
 The folder Id string from Forge Data Management API.
modelName String
 Specify the model name in Autodesk Project to save the model.
Exceptions
Exception | Condition
ArgumentException |  folderId is an empty string. -or- modelName is an empty string. -or- The input file name "modelName" does not represent a valid file name. -or- Thrown when the input account Id or project Id is invalid or unmatched.
ArgumentNullException |  A non-optional argument was null
ForbiddenForDynamicUpdateException |  SaveAs may not be called during dynamic update.
InvalidOperationException |  Saving is not allowed in the current application mode. -or- This Document is not a project document. -or- This Document is in an edit mode. -or- This Document is not a primary document, it is a linked document. -or- SaveAs is temporarily disabled. -or- This Document is a cloud model, cannot be saved as a cloud model. -or- There is a transaction phase left open (such as a transaction, sub-transaction of transaction group) at the time of invoking this method.
RevitServerCommunicationException |  Could be for any of the reasons related to network.
RevitServerInternalException |  Could be for any of the reasons that saveAs fails with RevitServerInternalException.
RevitServerModelAlreadyExistsException |  Failed due to there is a model with the same name already exists at the specified location.
RevitServerModelNameBreaksConventionException |  Failed due to the model name is breaking project naming convention.
RevitServerUnauthenticatedUserException |  User is not signed in with Autodesk id.
RevitServerUnauthorizedException |  You don't have the entitlement to perform the operation to this this Document. -or- User is not authorized to access the specified cloud project.
Remarks
Assumes that user is currently signed and has access to Autodesk cloud services. This operation will create a model on cloud and then create a local cache of the cloud model. This method cannot be used when current document is already in cloud.
You can use one of the following methods to save a local model as a workshared cloud model.
 If the local model is a workshared model, then it will be a workshared cloud model after you use this method successfully.
 If the local model is a non-workshared model, you can enable the workset with EnableWorksharing(String, String) and then save as a workshared cloud model.
 If the local model is a non-workshared model, and you have already saved it as a non-workshared cloud model, you can still enable the workset with EnableCloudWorksharing() to convert it to a workshared cloud model.
You cannot save a local workshared model as a non-workshared cloud model.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace